## CREDIT CARD FRAUD DETECTION

In [21]:
# Load the necessary libraries
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB, BernoulliNB, MultinomialNB
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.feature_selection import SelectPercentile
from sklearn.metrics import accuracy_score, confusion_matrix
from sklearn.tree import DecisionTreeRegressor
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score, confusion_matrix, log_loss, classification_report, f1_score 
from sklearn.neighbors import KNeighborsClassifier

In [22]:
df_info = pd.read_csv('dataset/cc_info.csv')

In [23]:
df_info.head()

        credit_card      city state  zipcode  credit_card_limit
0  1280981422329509    Dallas    PA    18612               6000
1  9737219864179988   Houston    PA    15342              16000
2  4749889059323202    Auburn    MA     1501              14000
3  9591503562024072   Orlando    WV    26412              18000
4  2095640259001271  New York    NY    10001              20000

In [24]:
df_transaction = pd.read_csv('dataset/transactions.csv')

In [25]:
df_transaction.head()

,credit_card,date,transaction_dollar_amount,Long,Lat
0,1003715054175576,2015-09-11 00:32:40,43.78,-80.174132,40.267370
1,1003715054175576,2015-10-24 22:23:08,103.15,-80.194240,40.180114
2,1003715054175576,2015-10-26 18:19:36,48.55,-80.211033,40.313004
3,1003715054175576,2015-10-22 19:41:10,136.18,-80.174138,40.290895
4,1003715054175576,2015-10-26 20:08:22,71.82,-80.238720,40.166719

In [26]:
df_info.isnull().sum()

credit_card          0
city                 0
state                0
zipcode              0
credit_card_limit    0
dtype: int64

In [27]:
df_transaction.isnull().sum()

credit_card                  0
date                         0
transaction_dollar_amount    0
Long                         0
Lat                          0
dtype: int64

In [28]:
# merge 
df = df_transaction.merge(df_info, on='credit_card')

In [29]:
df

,credit_card,date,transaction_dollar_amount,Long,Lat,city,state,zipcode,credit_card_limit
0,1003715054175576,2015-09-11 00:32:40,43.78,-80.174132,40.267370,Houston,PA,15342,20000
1,1003715054175576,2015-10-24 22:23:08,103.15,-80.194240,40.180114,Houston,PA,15342,20000
2,1003715054175576,2015-10-26 18:19:36,48.55,-80.211033,40.313004,Houston,PA,15342,20000
3,1003715054175576,2015-10-22 19:41:10,136.18,-80.174138,40.290895,Houston,PA,15342,20000
4,1003715054175576,2015-10-26 20:08:22,71.82,-80.238720,40.166719,Houston,PA,15342,20000
...,...,...,...,...,...,...,...,...,...
294583,9999757432802760,2015-09-10 19:43:33,127.23,-82.360952,32.978497,Louisville,GA,30434,6000
294584,9999757432802760,2015-08-06 21:00:13,84.90,-82.322721,33.061071,Louisville,GA,30434,6000
294585,9999757432802760,2015-09-22 16:15:47,77.54,-82.442130,32.949983,Louisville,GA,30434,6000
294586,9999757432802760,2015-08-27 18:08:24,144.05,-82.398587,32.976162,Louisville,GA,30434,6000
294587,9999757432802760,2015-08-22 00:14:52,154.36,-82.389680,33.068351,Louisville,GA,30434,6000

In [17]:
df.dtypes

credit_card                    int64
date                          object
transaction_dollar_amount    float64
Long                         float64
Lat                          float64
city                          object
state                         object
zipcode                        int64
credit_card_limit              int64
dtype: object

In [19]:
df.columns

Index(['credit_card', 'date', 'transaction_dollar_amount', 'Long', 'Lat',
       'city', 'state', 'zipcode', 'credit_card_limit'],
      dtype='object')